[{"author": "detarintehelavarlden", "body": "Thank you!", "created_utc": 1614326158, "score": 1}, {"author": "detarintehelavarlden", "body": "Thank you. I tried this, and yes, that numpy script was super fast. I don't know how to make it work for more than two files though. I'll try.", "created_utc": 1614326144, "score": 1}, {"author": "Scetric", "body": "Someone here summarized it really well", "created_utc": 1614326121, "score": 2}, {"author": "[deleted]", "body": "The only way to transfer files between a Pi and another computer (without moving a USB memory stick between them) is to use the network.  If you don't have a network that includes both your computer and the Pi then you need to make one.  So the first question is: Do you have a network that includes both your computer and your Pi?\n\n[](https://www.makeuseof.com/tag/copy-data-raspberry-pi-pc/)", "created_utc": 1614326116, "score": 2}, {"author": "Scetric", "body": "Thanks!", "created_utc": 1614326104, "score": 2}, {"author": "Scetric", "body": "I see, thanks so much! I’m aiming for a career in programming, so I will go ahead with the crash course.", "created_utc": 1614326091, "score": 44}, {"author": "Phillyclause89", "body": "Even though I criticized this post. I do agree that it can have value to your study.  I would be very interested to see you continue to make posts of increasing quality and adherence to the side bar rules and measure the difference in response times, count and quality across them.", "created_utc": 1614326040, "score": 2}, {"author": "wbeater", "body": "Look in pycharm if the interpreter is pointing to the right python instance (eg venv) and look what packages are installed.", "created_utc": 1614325948, "score": 1}, {"author": "KidsPython", "body": "My apology. Do you know how I can revoke my post? I tried to \"Hide\" the post, but it seemed having no real effect.", "created_utc": 1614325595, "score": 1}, {"author": "AtomicShoelace", "body": "Rule 1\n\n &gt; Posts must be related to you learning python, no links promoting blogs, videos, tutorials, or requests to hire someone.", "created_utc": 1614325385, "score": 1}, {"author": "BosseNova", "body": "A lot of people here have said they have problems with doing the boring stuff because its more of a manual, it doesnt teach the basics. I used crash course and it was good", "created_utc": 1614325153, "score": 9}, {"author": "wbeater", "body": "&gt;Is there another way?\n\nThere are, you could use [sockets](https://www.thepythoncode.com/article/send-receive-files-using-sockets-python), but like i and many other in this thread already said, just use ssh or in particular scp (which relies on ssh). It's the easiest approach.", "created_utc": 1614325040, "score": 2}, {"author": "[deleted]", "body": "[deleted]", "created_utc": 1614324966, "score": 0}, {"author": "CromulentInPDX", "body": "Maybe check out jedi. I use it in atom and it works rather well", "created_utc": 1614324926, "score": 2}, {"author": "philsabuster", "body": "So what was going on here was I thought you'd made a typo trying to help OP and just wanted to make sure it didn't confuse them.\n\nIn other words, I misread your post thinking you'd said:\n\n\\&gt; You mean \"multiply by ten.\" If you add **a** 0 to 100, you get 100\n\n(meaning, you are adding (i.e. appending) a 0 to a number when you multiply it by 10)\n\nIn which case you'd get a 1,000 (100 \\* 10) :)", "created_utc": 1614324787, "score": 1}, {"author": "resubleu", "body": "To quickly summarise the two:\n\nAutomate the boring stuff: Aimed at an audience that doesn’t do programming as their primary career. It does exactly what the title says, automates the boring stuff so you can be more efficient with general day to day tasks.\n\nPython Crash Course: Aimed to make you a great programmer, by teaching you good coding practices etc.\n\nThey’re both really good books and totally viable to do both. I personally started with Python Crash Course (which landed me a programming job) and then use Automate the boring stuff as a reference for general day to day tasks such as document creation, parsing documents, etc.\n\nProbably overly simplified, but both great books.", "created_utc": 1614324767, "score": 297}, {"author": "KevnBlack", "body": "Thank you for being clear and concise, doesn't seem too complicated.", "created_utc": 1614324691, "score": 1}, {"author": "KevnBlack", "body": "Seems simple enough, thanks!", "created_utc": 1614324677, "score": 1}, {"author": "Rubber2291", "body": "Seems like a good idea :) I should probably spend a little time learning about Reddit too lol. Coding seems interesting and complex (that’s why I chose to ask a coding question instead of a history, political, or sports question.) The insanely quick response I got is a good way to support my presentation topic since people in my major typically don’t know much about coding. This helps add to the ‘wow-factor’ I am trying to achieve in the presentation. I may also include your response because even though it didn’t fulfill my request, it shows how Reddit users seem to self-govern themselves and respond politely and in a articulate manner. This is something that you don’t see on any other apps/sites and it makes everything so much better!", "created_utc": 1614324677, "score": 2}, {"author": "LanthaYtrri", "body": "&gt;Is there another way? Like if Visual Basic send a key \"Get\" then it will triggered their connection. Can I use ethernet cable for transfer?  \n&gt;  \n&gt;I am new user of Raspberry expect me to be noob. Hehehe", "created_utc": 1614324648, "score": 1}, {"author": "lanemik", "body": "I friggin love type hints. I wish they were more awesome, though. More like typescript. I'd really love to have something as elegant as the TS interfaces. Alas... I'll have to make do with dataclasses or whatever hacky thing I come up with.\n\nIn any case, there was, for example, some code at my workplace recently. The way swagger was set up and the way the sqlalchemy models were set up, we get two different concepts of a model that have the same name. The code was written without type hints, so it took forever going back and forth through the code to try to figure out WTF was going on. Type hints made it so much clearer:\n\n    import logging\n    \n    from app.connexious import schema_objects as swagger\n    from app.db import models, managers\n    \n    logger = logging.getLogger(__name__)\n    \n    ThingResult = Optional[Dict[str, List[Union[int, float, str]]]\n    \n    \n    def do_the_thing(widgets: List[swagger.widget], numbers: List[int]) -&gt; ThingResult:\n        session = get_session()\n        widget_manager = managers.WidgetManager()\n    \n        for widget in widgets:\n            converted_params: ModelWidgetParams = widget_manager.convert_from_swagger(widget)\n            widget_to_save: models.widget = widget_manager.create(converted_params)\n            session.add(widget_to_save)\n    \n        try:\n            session.commit()\n        except sqlalchemy.ext.SQLAlchemyError as e:\n            logger.error(e)\n\nNow when anyone goes into that section of code, it's very clear what kind of widget they're dealing with at any given time. And as I make my way through the code, we're getting closer and closer to a mypy strict static type checking, so that's an added bonus. \n\nBut yeah, for your personal side project, type hints probably aren't something you need to concern yourself with.", "created_utc": 1614324638, "score": 3}, {"author": "LanthaYtrri", "body": "Is there another way? Like if Visual Basic send a key \"Get\" then it will triggered their connection. Can I use ethernet cable for transfer? \n\nI am new user of Raspberry expect me to be noob. Hehehe", "created_utc": 1614324590, "score": 1}, {"author": "fake823", "body": "At the moment you won't be able to install any of these packages (pandas, numpy, scipy, ...), as they don't support Big Sur yet. \n\nProbably you'll have to wait another few weeks or months.", "created_utc": 1614324514, "score": 0}, {"author": "BarbellSocrates", "body": "I’d like to know this as well", "created_utc": 1614324435, "score": 5}, {"author": "AtomicShoelace", "body": "I know this is kind of a useless comment to make, but I only want to add that I would probably rather use \n`[*map(tuple, df[:2].dropna(axis='columns').T.values]` \ninstead of \n`[ (x, y) for x, y in df[:2].dropna(axis='columns').T.values ]`. But most people would probably consider the list comprehension more pythonic, so hence why I think my comment is kind of useless.", "created_utc": 1614324410, "score": 1}, {"author": "Rubber2291", "body": "I’m catching some serious heat. I gotta add a disclaimer at the end of my presentation reminding people to follow the rules on subreddits, even when the people who tell you to follow the rules also tell you to break them xD. Thanks again my friend.", "created_utc": 1614324119, "score": 0}, {"author": "LanthaYtrri", "body": "Can I transfer my data automatically if I use scp? How can I code it?", "created_utc": 1614324040, "score": 1}, {"author": "Phillyclause89", "body": "I would encourage you to spend an hour doing one of the many wonderful and free python tutorials out there. I guarantee after that hour, you will have enough valid questions to post here and measure response times of. And who knows you may get hooked and pick up a valuable skill that can be applied to just about every modern day field.", "created_utc": 1614324006, "score": 2}, {"author": "[deleted]", "body": "Assuming that both machines are on the same network I would use the builtin OS tools.  On the [Pi you can use `scp`](https://www.raspberrypi.org/documentation/remote-access/ssh/scp.md).  Configure `cron` on the Pi to transfer when you require it.", "created_utc": 1614324002, "score": 2}, {"author": "wbeater", "body": "If though it is be possible to automate a task like this via python, it is not the right approach/\"too complex\". Just set up a passwordless ssh connection between your pi and your PC and set up a cron job to download these files via ssh.", "created_utc": 1614323967, "score": 2}, {"author": "urimessdoodious", "body": "happy to help! have a look on w3 schools python string methods where they explain each one. It's also Boolean logic if you're not so familiar with that.", "created_utc": 1614323905, "score": 2}, {"author": "commandlineluser", "body": "You can change the glob to `*.dat` to only match those files.\n\nYou can also use a glob for the subdirs instead of having to name them:\n\n    import os\n    from pathlib import Path\n\n    for subdir in Path(r'D:\\Datalog').glob('*/'):\n        for f in sorted(subdir.rglob('*.dat'), key=os.path.getctime)[:-1]:\n            print(f)", "created_utc": 1614323879, "score": 1}, {"author": "delasislas", "body": "You can use scp, could just run a cronjob.", "created_utc": 1614323787, "score": 2}, {"author": "commandlineluser", "body": "    &gt;&gt;&gt; df[:2]\n            Movie 1  Movie 2  Movie 3  Movie 4  Movie 5  Movie 6\n                                                                \n    User 1     0.25     1.25      NaN     1.25    -2.75      NaN\n    User 2      NaN     0.40      1.4     0.40    -1.60     -0.6\n\nYou can dropna() on the columns - which will leave you the intersection.\n\n    &gt;&gt;&gt; df[:2].dropna(axis='columns')\n            Movie 2  Movie 4  Movie 5\n                                     \n    User 1     1.25     1.25    -2.75\n    User 2     0.40     0.40    -1.60\n\nYou can then `.T` / `.transpose()` to get the shape you want.\n\n    &gt;&gt;&gt; df[:2].dropna(axis='columns').T\n             User 1  User 2\n    Movie 2    1.25     0.4\n    Movie 4    1.25     0.4\n    Movie 5   -2.75    -1.6\n\nGet the values\n\n    &gt;&gt;&gt; df[:2].dropna(axis='columns').T.values.tolist()\n    [[1.25, 0.4], [1.25, 0.4], [-2.75, -1.6]]\n\ntuples - various ways.\n\n    &gt;&gt;&gt; [ tuple(row) for row in df[:2].dropna(axis='columns').T.values ]\n    [(1.25, 0.4), (1.25, 0.4), (-2.75, -1.6)]\n\n\t&gt;&gt;&gt; list(df[:2].dropna(axis='columns').T.itertuples(index=False, name=None))\n    [(1.25, 0.4), (1.25, 0.4), (-2.75, -1.6)]\n\nCourtesy of /u/AtomicShoelace\n\n    &gt;&gt;&gt; [*map(tuple, df[:2].dropna(axis='columns').T.values]\n\t[(1.25, 0.4), (1.25, 0.4), (-2.75, -1.6)]", "created_utc": 1614323701, "score": 2}, {"author": "Tarchianolix", "body": "Are we gods now or something", "created_utc": 1614323624, "score": 3}, {"author": "lanemik", "body": "    &gt;&gt;&gt; df\n            Movie 1  Movie 2  Movie 3  Movie 4  Movie 5\n    User 1     0.25     1.25      NaN     1.25    -2.75\n    User 2      NaN     0.40      1.4     0.40    -1.60\n    User 3    -0.50      NaN     -1.5     0.50      NaN\n    &gt;&gt;&gt; df.loc['User 1':'User 2', :].dropna(axis='columns')\n            Movie 2  Movie 4  Movie 5\n    User 1     1.25     1.25    -2.75\n    User 2     0.40     0.40    -1.60", "created_utc": 1614323577, "score": 2}, {"author": "Rubber2291", "body": "I understand that I may be going about this the wrong way, but I don’t know the “right” way to ask the type of question I did. I am new to Reddit and I am unfamiliar with the site. I read the rules, and I don’t believe I stepped outside them. I don’t know what broken code is or how to find it. I also don’t want to lie and say I wrote some code and it’s not working when it is easily accessible online (and the rules say you should try to go online and find the answer to a question before you come here). I would also be breaking the rules if I did so because I would be asking a question that I can easily find the answer to online. So, now that you asked me to break the rules after telling me to “respect the sidebar rules and make a post that follows them,” I will continue. My question was really a request for someone to help me with a project that involves asking Reddit users for help to solve a problem. The problem I chose to ask someone to solve is a coding problem. I came to r/learnpython because that seemed like the best place for someone to answer a question about python (the only coding language with a name that I remember). My question/request isn’t offensive, I can’t look it up because the request/question is literally asking someone on Reddit to respond to a coding question, I can’t read the Wiki for answers because, again, my request requires a Reddit user to respond, and I asked a question about Python (not specifically, but since I posted on r/learnpython, one would assume I am a requesting a response that is written in Python). I am sorry if you feel that I went about this the wrong way but I hope you understand my reasoning :)", "created_utc": 1614323411, "score": 2}, {"author": "[deleted]", "body": "Sorry, can't help with that as I don't use VMs on Mac.  I use \"real\" VMs in the cloud only.  When I said \"virtual environment \" I meant using the `virtualenv` and `virtualenvwrapper` packages.\n\nhttps://packaging.python.org/guides/installing-using-pip-and-virtual-environments/\n\nhttps://virtualenv.pypa.io/en/latest/\n\nhttps://virtualenvwrapper.readthedocs.io/en/latest/", "created_utc": 1614323395, "score": 1}, {"author": "primitive_screwhead", "body": "[https://stackoverflow.com/questions/55560258/why-python-raises-recursionerror-before-it-exceeds-the-real-recursion-limit](https://stackoverflow.com/questions/55560258/why-python-raises-recursionerror-before-it-exceeds-the-real-recursion-limit)\n\n&amp;#x200B;\n\nBasically, there are additional users of the stack, so it hits the limit before you reach the set recursion limit.  The print() call, in particular, likely affects the trigger point.\n\nNote, there is currently active development around recursion limits in upcoming Python 3.10, but I don't know if it'll change this particular behavior or not.", "created_utc": 1614323254, "score": 2}, {"author": "Laurence-Lin", "body": "Thank you! So if I define the child class attributes in child's  \\_\\_init\\_\\_(), and never initialize the Parent class with super.\\_\\_init\\_\\_, my child object would only contain the attributes that I set, but without the parent class attribute, am I right?", "created_utc": 1614323195, "score": 1}, {"author": "fake823", "body": "It's because:\n\n\"running scripts is disabled on this system\"", "created_utc": 1614322998, "score": 2}, {"author": "-Kevin-", "body": "I think it makes the code look a pain to work with when it's overused personally", "created_utc": 1614322818, "score": 1}, {"author": "delasislas", "body": "Where are you getting os.execl()? Have you looked at the documentation and seen what the function does?\n\nEdit: assuming that you are talking about the os module( Yes, I’ve seen people actually choose stupid names for modules before, so that’s why I asked)\n\nAfter scanning through the documentation in reference to os.execl: These functions all execute a new program, replacing the current process; they do not return.\n\nThis was the first sentence following the block of functions.", "created_utc": 1614322742, "score": 1}, {"author": "[deleted]", "body": "This is very basic.  It might be best if you go back to the tutorial you are following and review dictionaries.  Or read the [doc on dictionaries](https://docs.python.org/3/tutorial/datastructures.html#dictionaries).", "created_utc": 1614322715, "score": 0}, {"author": "wbeater", "body": "I'm not sure what you are trying to do or if you use the `abs()` function the right way.  if a is a positive number b = abs(a) = a (mathematically expression not python syntax) is always true.\n\nSo please explain us what you are trying to do.", "created_utc": 1614322710, "score": 1}, {"author": "lanemik", "body": "    &gt;&gt;&gt; d = {'a': 1, 'b': 2, 'c': 3}\n    &gt;&gt;&gt; d['a']\n    1\n    &gt;&gt;&gt; d.get('a')\n    1\n    &gt;&gt;&gt; d.get('d', 'oh no!')\n    'oh no!'", "created_utc": 1614322692, "score": 1}, {"author": "AtomicShoelace", "body": "What do you mean exactly by \"slice a dictionary\"? If you're talking about list slicing, you can't. \n\nWhat do you mean by \"get 1\" from `{‘a’:1, ‘b’:2, ‘c’:3}`? You can lookup the value of the key `'a'`, eg. \n\n    d = {‘a’:1, ‘b’:2, ‘c’:3}\n    print(d['a'])\n\nWhat do you mean by \"get `'a'`\"? In this dictionary `'a'` is a key. You can iterate over the keys of a dictionary by just using the dict as an iterator in the usual way, eg.\n\n    d = {‘a’:1, ‘b’:2, ‘c’:3}\n    for key in d:\n        print(key)", "created_utc": 1614322663, "score": 2}, {"author": "[deleted]", "body": "First off, you haven't formatted your code, which means there are indentation errors.  The FAQ [shows how to format](/r/learnpython/w/FAQ).\n\nWe don't know what you expected the code to do, so how can we tell what's wrong?\n\nThere are obvious logic errors caused by not *thinking* about what you wrote.  For instance:\n\n    if b &lt; 1000:\n        print(\"b is greater than a\")\n\nIf a is 50000 then the only thing `b &lt; 1000` can tell you is that `b` is less than 1000 or not.\n\nMaybe you should tell us what problem you are trying to solve?", "created_utc": 1614322500, "score": 2}, {"author": "teetaps", "body": "I don’t know what technological rock you’ve been living under but conda is almost without a doubt the first option for this problem that just about every modern python programmer (and other languages too) would go with", "created_utc": 1614322438, "score": 0}, {"author": "lanemik", "body": "The only time that I avoid using f-strings is if there is some expensive computation that I need to defer when I'm using logging. Check this out to see what I mean:\n\n    &gt;&gt;&gt; import logging\n    &gt;&gt;&gt; logging.basicConfig(level=logging.INFO)\n    &gt;&gt;&gt; logger = logging.getLogger('test_logger')\n    &gt;&gt;&gt; class Foo:\n      2     def __str__(self):\n      3         print(\"I'm doing some expensive calculation!\")\n      4         return self.__class__.__name__\n    &gt;&gt;&gt; foo = Foo()\n    &gt;&gt;&gt; logger.debug('Logging output at debug level with the foo obj: %s', foo)\n    &gt;&gt;&gt; logger.debug(f'Logging output at debug level with the foo obj in an f-string: {foo}')\n    I'm doing some expensive calculation!\n    &gt;&gt;&gt; logger.debug('Note that logger is not using %%-style strings either! This %%-style string is evaluated again with %s' % foo)\n    I'm doing some expensive calculation!\n    &gt;&gt;&gt; logger.info('It is only when we are logging at the INFO level that we want to evaluate foo: %s', foo)\n    I'm doing some expensive calculation!\n    INFO:test_logger:It is only when we are logging at the INFO level that we want to evaluate foo: Foo\n\nNote that the logger's internals are set up so that the evaluation of the foo object's \\_\\_str\\_\\_ is deferred so long as foo is passed as another parameter to the logger. If you use f-strings or %-style strings, the foo object was evaluated even if the logger was not going to log with it.\n\nThis may not be a big deal most of the time. But if, for example, you have some log that is pulling data from a database, using f-strings could end up being very expensive, indeed!", "created_utc": 1614322430, "score": 1}, {"author": "Tarchianolix", "body": "Well first, what exactly went wrong? Your comparisons make no sense to me since you are saying if b is less than 1000 (and not less than a) then b is greater than a? The math logic doesn't make sense, but maybe that's not the problem you are encountering.\n\nI can't tell you what went wrong if you dont include what exactly is the problem you have", "created_utc": 1614322343, "score": 4}, {"author": "brownbrutus", "body": "That's true", "created_utc": 1614322316, "score": 1}, {"author": "Ok-Design-3218", "body": "Will do ,", "created_utc": 1614322087, "score": 1}, {"author": "KlontZ", "body": "I've been trying to get a VM up but I've been getting tons of issues. Can you recommend a video to get up a VM with VirtualBox or something (that will work with M1) because thatd be amazing.", "created_utc": 1614322041, "score": 1}, {"author": "xelf", "body": "Max recursion depth is of the whole python stack, not just your function call. So leave some extra room.\n\nBut why are you doing it this way at all? \n\nWhy not just pass a depth variable?\n\n\n    def f(n=0, maxdepth=10):\n        print(n)\n        if n &gt;= maxdepth:\n            return\n        else:\n            f(n + 1, maxdepth)\n    f()", "created_utc": 1614322041, "score": 3}, {"author": "[deleted]", "body": "Agreed, but there's no more recent \"bible\", which was my point.", "created_utc": 1614321957, "score": 4}, {"author": "[deleted]", "body": "Ouch!  Definitely look into which combinations of python+whatever install from binary.  I also recommend using virtual environments for playing around.  That means you can try an install and delete it afterwards, without touching your main installed packages.", "created_utc": 1614321877, "score": 1}, {"author": "spez_edits_thedonald", "body": "&gt;In the end the system and these managers just end up fighting each other and shit goes crazy.\n\nI remember feeling like this, it was before I started using conda haha\n\n&gt;I found the option with the python installer.\n\nNice\n\n&gt;Conda is a wrapper that just hijacks a few install commands and seems to make an alias for itself.\n\nThis is false, it installs packages and manages them in a contained way", "created_utc": 1614321848, "score": 2}, {"author": "[deleted]", "body": "No need.  When you feel comfortable you could try helping others here yourself.  It doesn't take much experience.  If it's something you've just struggled with yourself then you know exactly how to solve the problem.", "created_utc": 1614321847, "score": 2}, {"author": "Phillyclause89", "body": "you are going about this in the wrong way. You should respect the sidebar rules and make a post that follows them. It should take you minutes to find some broken code and post it to this sub asking what's wrong with it. You'll get answers pretty quickly.   \n\n\nAlso a real study on reddit question response times would just use the reddit API to get all the post and comment times.", "created_utc": 1614321645, "score": 1}, {"author": "nugelz", "body": "Not OP buy thank you so much for the cheat sheet!", "created_utc": 1614321609, "score": 1}, {"author": "Rubber2291", "body": "Wow that was quick. I don’t need to run it (nor do I know how) but thank you so much. The power of Reddit is real!", "created_utc": 1614321596, "score": 1}, {"author": "brownbrutus", "body": "Well, [PEP 8 is quite old](https://www.python.org/dev/peps/pep-0008/). It only covers the basics.", "created_utc": 1614321502, "score": 2}, {"author": "c419331", "body": "Looks terrible to me but I've never used it. Kind of like snap, brew and I forgot the other one. In the end the system and these managers just end up fighting each other and shit goes crazy. \n\n I found the option with the python installer. \n\nConda is a wrapper that just hijacks a few install commands and seems to make an alias for itself.", "created_utc": 1614321470, "score": 0}, {"author": "spez_edits_thedonald", "body": "Program (could save this as `script.py` then run it):\n\n    import math\n    \n    def calc_area(diameter):\n        '''Calculate the area of a circle, given diameter.'''\n        r = diameter / 2\n        area = math.pi * (r ** 2)    \n        return(area)\n    \n    def calc_cost_density(cost, diameter):\n        '''Calculate the cost per square inch of a circle, given cost and diameter.'''\n        area = calc_area(diameter)\n        cost_per_sq_in = cost / area\n        return(cost_per_sq_in)\n    \n    def appraise_pizza(cost, diameter):\n        '''Display a breakdown of pizza cost per area, given cost and diameter.'''\n        cost_density = calc_cost_density(cost, diameter)\n        print(f'A ${cost:.2f} {diameter}\" pizza costs ${cost_density:.2f}/in^2')\n    \n    # test functions\n    appraise_pizza(10.00, 12)\n    appraise_pizza(25.00, 18)\n    appraise_pizza(5.55, 10)\n\ndemo:\n    \n    &gt;&gt;&gt; import math\n    &gt;&gt;&gt;\n    &gt;&gt;&gt; def calc_area(diameter):\n    ...     '''Calculate the area of a circle, given diameter.'''\n    ...     r = diameter / 2\n    ...     area = math.pi * (r ** 2)\n    ...     return(area)\n    ...\n    &gt;&gt;&gt; def calc_cost_density(cost, diameter):\n    ...     '''Calculate the cost per square inch of a circle, given cost and diameter.'''\n    ...     area = calc_area(diameter)\n    ...     cost_per_sq_in = cost / area\n    ...     return(cost_per_sq_in)\n    ...\n    &gt;&gt;&gt; def appraise_pizza(cost, diameter):\n    ...     '''Display a breakdown of pizza cost per are, given cost and diameter.'''\n    ...     cost_density = calc_cost_density(cost, diameter)\n    ...     print(f'A ${cost:.2f} {diameter}\" pizza costs ${cost_density:.2f}/in^2')\n    ...\n    &gt;&gt;&gt; # test functions\n    &gt;&gt;&gt; appraise_pizza(10.00, 12)\n    A $10.00 12\" pizza costs $0.09/in^2\n    &gt;&gt;&gt; appraise_pizza(25.00, 18)\n    A $25.00 18\" pizza costs $0.10/in^2\n    &gt;&gt;&gt; appraise_pizza(5.55, 10)\n    A $5.55 10\" pizza costs $0.07/in^2", "created_utc": 1614321426, "score": -2}, {"author": "brownbrutus", "body": "definitely agree with the clarity", "created_utc": 1614321348, "score": 1}, {"author": "Rubber2291", "body": "EDIT: If you want to add an explanation about how you wrote the program, that would probably help me illustrate the “power of Reddit” as opposed to just commenting the code by itself. It can be simple and brief as no one in my class, including myself, has any idea how to code lol.", "created_utc": 1614321339, "score": 1}, {"author": "[deleted]", "body": "The recursion limit limits the number of times you can call a function.  Every time you call a function a \"stackframe\" is used to store various things including the place in the code to return to when the function you call finishes.  When there are no empty stackframes left you get a RecursionError exception.  The default recursion limit is set to 1000 stackframes.  Setting the limit to 10 is very restrictive, *especially when you realize that some stackframes are used in just starting python*.  It looks like 4 or 5 stackframes were used before running your code.\n\n&gt; Why does it only count up to 5?\n\nBecause there were only 5 free stackframes before you started recursing.\n\n&gt; Why is \"5\" still printed after exceeding the maximum recursion depth?\n\nNot really sure, but possibly because the 5 was in the stdout buffer and not yet printed, and the exception handling code flushed that buffer last thing.", "created_utc": 1614321215, "score": 8}, {"author": "Scetric", "body": "Wait I have the pfd link for the newer edition if you want it. It’s an amazing book.", "created_utc": 1614321183, "score": 2}, {"author": "Scetric", "body": "It’s python 3.6, you should be fine", "created_utc": 1614321149, "score": 1}, {"author": "spez_edits_thedonald", "body": "No, conda is a widely used environment manager. It is self-contained, easy to remove, doesn't damage your system package. The packages won't be visible to multiple users so it doesn't solve your problem, that sounds like needing admin access. But conda is good not bad.", "created_utc": 1614321056, "score": 1}, {"author": "backtickbot", "body": "[Fixed formatting.](https://np.reddit.com/r/backtickbot/comments/lsrqvo/httpsnpredditcomrlearnpythoncommentslrybthcan/)\n\nHello, PinkPandaa: code blocks using triple backticks (\\`\\`\\`) don't work on all versions of Reddit!\n\nSome users see [this](https://stalas.alm.lt/backformat/gosximw.png) / [this](https://stalas.alm.lt/backformat/gosximw.html) instead.\n\nTo fix this, **indent every line with 4 spaces** instead.\n\n[FAQ](https://www.reddit.com/r/backtickbot/wiki/index)\n\n^(You can opt out by replying with backtickopt6 to this comment.)", "created_utc": 1614321040, "score": 1}, {"author": "PinkPandaa", "body": "\n    a=\"PythonProgram\n\n    for i in range(0, 3):\n        for j in range(0, (i+1)*2):\n            print(a[j], end=\"\") \n        a=a[j+1:]\n        print(\"\")\n\nIf you understand what `a=a[j+1:]` does, this would be a solution.\nOtherwise you have to figure out how to offset the j range in each loop, to start at the correct Index of the string.\nI would start by using a helper variable `old_j`", "created_utc": 1614321026, "score": 1}, {"author": "ChurchHatesTucker", "body": "It's a comment that an ide won't fold. \n\nSo, good idea I guess. Not necessary, strictly speaking.", "created_utc": 1614321009, "score": 1}, {"author": "vorticalbox", "body": "No you can use type hints and still have terrible code.", "created_utc": 1614320907, "score": 12}, {"author": "[deleted]", "body": "So this is really two separate tasks you're wanting to do here. First you want to randomly select one of three options. That's pretty easy with the random module. `random.randint(1, 3)` will create a random integer from 1 to 3.  \n\n\nAs for making a wheel that will depend on the gui you use. I'm not super experienced with python gui so maybe someone else can answer better but I would just start by googling how to make animations in the gui you're using currently. Tkinter is the only gui I know off the top of my head here.", "created_utc": 1614320703, "score": 2}, {"author": "Ok-Design-3218", "body": "I think I have a pretty solid idea of what we're talking about now. Enough that at least I should be able to figure it out from here. Thank you so much again. \n\nCan I send some crypto to buy you a beer, or whatever?", "created_utc": 1614320654, "score": 1}, {"author": "ChurchHatesTucker", "body": "If you managed to pass the unit tests it's all good :)", "created_utc": 1614320566, "score": 2}, {"author": "GoLang_Noob", "body": "I see. I got it. Thank you for being so nice and your great help.", "created_utc": 1614320531, "score": 1}, {"author": "c419331", "body": "Update... This unfortunately sounds like a terrible idea and I would suggest you don't do it either. It's a wrapper on top of a wrapper. Going to break things eventually using this  It's possible to install via the cli using the python package itself.", "created_utc": 1614320442, "score": -1}, {"author": "MontyCoco", "body": "Thanks, I will look into it.", "created_utc": 1614320432, "score": 1}, {"author": "KlontZ", "body": "Ah darn. Thanks for your help so far though. Also, pandas was just an example. It happens like this to everyone I've tried so far.", "created_utc": 1614320405, "score": 1}, {"author": "spez_edits_thedonald", "body": "&gt;a .py file and try to execute it from the command prompt\n\ntry running it in the `Anaconda Prompt` program instead\n\n----------------------\n\nwhat's going on under the hood is: the packages you're importing are installed via conda, so in order for your system to find them, the conda package locations need to be on your system's $PATH environmental variable. Anaconda programs like Prompt and Jupyter will update the $PATH as needed when they start up, but the normal command prompt is not configured for that. \n\nIf you would like to configure it, you need to run `conda init`, the problem is the command prompt can't see the conda program lol, catch 22... So you need to prive the whole path to conda.exe for this command, something like:   \n\n`C:\\Users\\YOUR_USER\\Anaconda3\\Scripts\\conda.exe init` (to learn the exact path, run `where conda` in the `Anaconda Prompt` program) then it will tell you to restart the command prompt. You can re-open command prompt and run `conda --version` to verify that conda is set up correctly", "created_utc": 1614320303, "score": 1}, {"author": "[deleted]", "body": "You need to test the string in `operator`.  The line `if \"*\":` always executes the True code, no matter what is in `operator`.\n\nI imagined the `result` variable would contain the value resulting from adding (subtracting, etc) the two numbers.", "created_utc": 1614320230, "score": 2}, {"author": "spez_edits_thedonald", "body": "switch to conda!", "created_utc": 1614320205, "score": 1}, {"author": "toastedstapler", "body": "depends on the coding guidelines of whatever project you're on. personally i like type hints and i would use them if i was doing any non trivial python script, as it makes it so much clearer what the interface of the function is. there's a good reason why all these dynamic languages have been picking up some form of type hints", "created_utc": 1614320119, "score": 5}, {"author": "spez_edits_thedonald", "body": "check out https://www.reddit.com/r/learnpython/comments/3apspj/spinning_wheel/", "created_utc": 1614320099, "score": 1}, {"author": "c419331", "body": "Only downside is that it needs to be in a directory that multiple groups can have access to, not just give e directories.\n\nI also have no idea what conda is", "created_utc": 1614319936, "score": 1}, {"author": "[deleted]", "body": "Personally, I think hints clutter up the code, but YMMV.  Just don't think they enforce anything.  There are no runtime checks and that function you defined as expecting an integer can still get passed `None`.\n\nThe semi-standard for code [PEP 8](https://pep8.org/) doesn't mention hinting at all.", "created_utc": 1614319930, "score": 2}, {"author": "spez_edits_thedonald", "body": "&gt;What's the best way to get both versions installed without having root, without breaking the old environment?\n\nI would use [conda](https://docs.conda.io/en/latest/miniconda.html) for this, it will install things in your user's home directory so no root needed, and it won't mess with anything that's already installed.\n\n* install miniconda\n\n* python 3 is installed\n\nwhat operating system do you have? are you familiar with command-line/terminal?", "created_utc": 1614319822, "score": 1}, {"author": "Ok-Design-3218", "body": "I think I figured it out. I want to thank you again. Let me know if I can crypto you a beer!", "created_utc": 1614319704, "score": 2}, {"author": "spez_edits_thedonald", "body": "I tried limits of `10`, `20`, `25`, it always seems to be missing 5 then error, then another one, no idea lol", "created_utc": 1614319692, "score": 1}, {"author": "cuy_hrm", "body": "Nah, it's mod_wsgi, it doesn't seem to be able to sort out the venvs.\nWe ended up using gunicorn (it's an internal app, we don't have many users), now it works...", "created_utc": 1614319680, "score": 1}, {"author": "[deleted]", "body": "It looks like the M1 might be the problem.  The big difference betwee  my install and yours is that mine downloads a binary wheel (*.whl file) and yours appears to be downloading source and failing during the build.  I probably can't help any more, but this appears to be a common problem.  Searching for \"problem pip install pandas m1 mac\" gets quite a few hits.\n\nYou could try using 3.8 instead of 3.9, maybe there are binary wheels for M1+3.8.  Alternatively, see if earlier versions of pandas and numpy have binary files for the M1.", "created_utc": 1614319549, "score": 1}, {"author": "lobomos", "body": "Pretty tired and not at a computer but I think it may work properly if you returned f(n+1) in the else block instead of just calling the function... as is now though I’d have to actually run it in a debug to see why it’s functioning how it is.", "created_utc": 1614319507, "score": 1}, {"author": "Ok-Design-3218", "body": "One: definitely no need to be sorry, I think you being this patient is amazing.\n\nTwo: I think Im getting it finally.\n\nObviously, I need to fix some stuff and clean it up , but you are talking about this , correct? I was just starting to work with it and your message came and cleared it up more.\n\n&amp;#x200B;\n\n    if \"*\":\n        result = \"first_number * second_number\"\n        print(first_number, operation, second_number, result)\n    elif \"-\":\n        result = \"first_number - second_number\"\n        print(first_number, operation, second_number, result)\n    else:\n        print(\"fhjdk\"", "created_utc": 1614319274, "score": 1}, {"author": "schfourteen-teen", "body": "I think you are looking for a priority queue. That's commonly the data structure used for discrete event simulation (which is what it sounds like you are building). This let's you insert new events into the list and keeps it sorted by event_time so you can just pull the next occurring event right off the list.", "created_utc": 1614319240, "score": 1}, {"author": "ScarAlert", "body": "A bit of modification to ur code works for me but I have two more subfolders (log, data) under every A, B, C, D subfolder. \n\nCurrent output\n\n`D:\\DataLog\\A\\Data`\n\n`D:\\DataLog\\A\\log`\n\n`D:\\DataLog\\A\\Data\\2021-2-23-1-56-23.dat.dat`\n\n`D:\\DataLog\\A\\Data\\2021-2-22-02-12-12.dat.dat`\n\n`D:\\DataLog\\A\\Data\\2021-1-23-10-12-34.dat.dat`\n\n`D:\\DataLog\\A\\Data\\2021-2-24-02-23-24.dat.dat`\n\n`D:\\DataLog\\B\\Data`\n\n`D:\\DataLog\\B\\log`\n\n`D:\\DataLog\\B\\Data\\2021-02-21-23-22-54.dat.dat` \n\n`D:\\DataLog\\C\\Data`\n\n`D:\\DataLog\\C\\log`\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nI don't want {`D:\\DataLog\\B\\Data,D:\\DataLog\\B\\log} these files. I only want a path that has files for eg: {D:\\DataLog\\B\\Data\\2021-02-21-23-22-54.dat.dat}`", "created_utc": 1614319235, "score": 1}, {"author": "KlontZ", "body": "I used pip3 install pandas. I'm running Big Sur 11.2 and I'm running it on a 2020 M1 MBP.", "created_utc": 1614318749, "score": 1}, {"author": "spez_edits_thedonald", "body": "for anyone that doesn't know, run\n\n`import this`\n\nin python", "created_utc": 1614318674, "score": 2}]